{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[UNK]": 0,
      "[PAD]": 1,
      "[MASK]": 2,
      "c00": 3,
      "c01": 4,
      "c02": 5,
      "c03": 6,
      "c04": 7,
      "c05": 8,
      "c06": 9,
      "c07": 10,
      "c08": 11,
      "c09": 12,
      "c010": 13,
      "c011": 14,
      "c012": 15,
      "c013": 16,
      "c014": 17,
      "c015": 18,
      "c016": 19,
      "c017": 20,
      "c018": 21,
      "c019": 22,
      "c020": 23,
      "c021": 24,
      "c022": 25,
      "c023": 26,
      "c024": 27,
      "c025": 28,
      "c026": 29,
      "c027": 30,
      "c028": 31,
      "c029": 32,
      "c030": 33,
      "c031": 34,
      "c032": 35,
      "c033": 36,
      "c034": 37,
      "c035": 38,
      "c036": 39,
      "c037": 40,
      "c038": 41,
      "c039": 42,
      "c040": 43,
      "c041": 44,
      "c042": 45,
      "c043": 46,
      "c044": 47,
      "c045": 48,
      "c046": 49,
      "c047": 50,
      "c048": 51,
      "c049": 52,
      "c050": 53,
      "c051": 54,
      "c052": 55,
      "c053": 56,
      "c054": 57,
      "c055": 58,
      "c056": 59,
      "c057": 60,
      "c058": 61,
      "c059": 62,
      "c060": 63,
      "c061": 64,
      "c062": 65,
      "c063": 66,
      "c064": 67,
      "c065": 68,
      "c066": 69,
      "c067": 70,
      "c068": 71,
      "c069": 72,
      "c070": 73,
      "c071": 74,
      "c072": 75,
      "c073": 76,
      "c074": 77,
      "c075": 78,
      "c076": 79,
      "c077": 80,
      "c078": 81,
      "c079": 82,
      "c080": 83,
      "c081": 84,
      "c082": 85,
      "c083": 86,
      "c084": 87,
      "c085": 88,
      "c086": 89,
      "c087": 90,
      "c088": 91,
      "c089": 92,
      "c090": 93,
      "c091": 94,
      "c092": 95,
      "c093": 96,
      "c094": 97,
      "c095": 98,
      "c096": 99,
      "c097": 100,
      "c098": 101,
      "c099": 102,
      "c0100": 103,
      "c0101": 104,
      "c0102": 105,
      "c0103": 106,
      "c0104": 107,
      "c0105": 108,
      "c0106": 109,
      "c0107": 110,
      "c0108": 111,
      "c0109": 112,
      "c0110": 113,
      "c0111": 114,
      "c0112": 115,
      "c0113": 116,
      "c0114": 117,
      "c0115": 118,
      "c0116": 119,
      "c0117": 120,
      "c0118": 121,
      "c0119": 122,
      "c0120": 123,
      "c0121": 124,
      "c0122": 125,
      "c0123": 126,
      "c0124": 127,
      "c0125": 128,
      "c0126": 129,
      "c0127": 130,
      "c0128": 131,
      "c0129": 132,
      "c0130": 133,
      "c0131": 134,
      "c0132": 135,
      "c0133": 136,
      "c0134": 137,
      "c0135": 138,
      "c0136": 139,
      "c0137": 140,
      "c0138": 141,
      "c0139": 142,
      "c0140": 143,
      "c0141": 144,
      "c0142": 145,
      "c0143": 146,
      "c0144": 147,
      "c0145": 148,
      "c0146": 149,
      "c0147": 150,
      "c0148": 151,
      "c0149": 152,
      "c0150": 153,
      "c0151": 154,
      "c0152": 155,
      "c0153": 156,
      "c0154": 157,
      "c0155": 158,
      "c0156": 159,
      "c0157": 160,
      "c0158": 161,
      "c0159": 162,
      "c0160": 163,
      "c0161": 164,
      "c0162": 165,
      "c0163": 166,
      "c0164": 167,
      "c0165": 168,
      "c0166": 169,
      "c0167": 170,
      "c0168": 171,
      "c0169": 172,
      "c0170": 173,
      "c0171": 174,
      "c0172": 175,
      "c0173": 176,
      "c0174": 177,
      "c0175": 178,
      "c0176": 179,
      "c0177": 180,
      "c0178": 181,
      "c0179": 182,
      "c0180": 183,
      "c0181": 184,
      "c0182": 185,
      "c0183": 186,
      "c0184": 187,
      "c0185": 188,
      "c0186": 189,
      "c0187": 190,
      "c0188": 191,
      "c0189": 192,
      "c0190": 193,
      "c0191": 194,
      "c0192": 195,
      "c0193": 196,
      "c0194": 197,
      "c0195": 198,
      "c0196": 199,
      "c0197": 200,
      "c0198": 201,
      "c0199": 202,
      "c0200": 203,
      "c0201": 204,
      "c0202": 205,
      "c0203": 206,
      "c0204": 207,
      "c0205": 208,
      "c0206": 209,
      "c0207": 210,
      "c0208": 211,
      "c0209": 212,
      "c0210": 213,
      "c0211": 214,
      "c0212": 215,
      "c0213": 216,
      "c0214": 217,
      "c0215": 218,
      "c0216": 219,
      "c0217": 220,
      "c0218": 221,
      "c0219": 222,
      "c0220": 223,
      "c0221": 224,
      "c0222": 225,
      "c0223": 226,
      "c0224": 227,
      "c0225": 228,
      "c0226": 229,
      "c0227": 230,
      "c0228": 231,
      "c0229": 232,
      "c0230": 233,
      "c0231": 234,
      "c0232": 235,
      "c20": 236,
      "c21": 237,
      "c22": 238,
      "c23": 239,
      "c24": 240,
      "c25": 241,
      "c26": 242,
      "c27": 243,
      "c28": 244,
      "c29": 245,
      "c210": 246,
      "c211": 247,
      "c212": 248,
      "c213": 249,
      "c214": 250,
      "c215": 251,
      "c216": 252,
      "c217": 253,
      "c218": 254,
      "c219": 255,
      "c220": 256,
      "c221": 257,
      "c222": 258,
      "c223": 259,
      "c224": 260,
      "c225": 261,
      "c226": 262,
      "c227": 263,
      "c228": 264,
      "c229": 265,
      "c230": 266,
      "c231": 267,
      "c232": 268,
      "c233": 269,
      "c234": 270,
      "c235": 271,
      "c236": 272,
      "c237": 273,
      "c238": 274,
      "c239": 275,
      "c240": 276,
      "c241": 277,
      "c242": 278,
      "c243": 279,
      "c244": 280,
      "c245": 281,
      "c246": 282,
      "c247": 283,
      "c248": 284,
      "c249": 285,
      "c250": 286,
      "c251": 287,
      "c252": 288,
      "c253": 289,
      "c254": 290,
      "c255": 291,
      "c256": 292,
      "c257": 293,
      "c258": 294,
      "c259": 295,
      "c260": 296,
      "c261": 297,
      "c262": 298,
      "c263": 299,
      "c264": 300,
      "c265": 301,
      "c266": 302,
      "c267": 303,
      "c268": 304,
      "c269": 305,
      "c270": 306,
      "c271": 307,
      "c272": 308,
      "c273": 309,
      "c274": 310,
      "c275": 311,
      "c276": 312,
      "c277": 313,
      "c278": 314,
      "c279": 315,
      "c280": 316,
      "c281": 317,
      "c282": 318,
      "c283": 319,
      "c284": 320,
      "c285": 321,
      "c286": 322,
      "c287": 323,
      "c288": 324,
      "c289": 325,
      "c290": 326,
      "c291": 327,
      "c292": 328,
      "c293": 329,
      "c294": 330,
      "c295": 331,
      "c296": 332,
      "c297": 333,
      "c298": 334,
      "c299": 335,
      "c2100": 336,
      "c2101": 337,
      "c2102": 338,
      "c2103": 339,
      "c2104": 340,
      "c2105": 341,
      "c2106": 342,
      "c2107": 343,
      "c2108": 344,
      "c2109": 345,
      "c2110": 346,
      "c2111": 347,
      "c2112": 348,
      "c2113": 349,
      "c2114": 350,
      "c2115": 351,
      "c2116": 352,
      "c2117": 353,
      "c2118": 354,
      "c2119": 355,
      "c2120": 356,
      "c2121": 357,
      "c2122": 358,
      "c2123": 359,
      "c2124": 360,
      "c2125": 361,
      "c2126": 362,
      "c2127": 363,
      "c2128": 364,
      "c2129": 365,
      "c2130": 366,
      "c2131": 367,
      "c2132": 368,
      "c2133": 369,
      "c2134": 370,
      "c2135": 371,
      "c2136": 372,
      "c2137": 373,
      "c2138": 374,
      "c2139": 375,
      "c2140": 376,
      "c2141": 377,
      "c2142": 378,
      "c2143": 379,
      "c2144": 380,
      "c2145": 381,
      "c2146": 382,
      "c2147": 383,
      "c2148": 384,
      "c2149": 385,
      "c2150": 386,
      "c2151": 387,
      "c2152": 388,
      "c2153": 389,
      "c2154": 390,
      "c2155": 391,
      "c2156": 392,
      "c2157": 393,
      "c2158": 394,
      "c2159": 395,
      "c2160": 396,
      "c2161": 397,
      "c2162": 398,
      "c2163": 399,
      "c2164": 400,
      "c2165": 401,
      "c2166": 402,
      "c2167": 403,
      "c2168": 404,
      "c2169": 405,
      "c2170": 406,
      "c2171": 407,
      "c2172": 408,
      "c2173": 409,
      "c2174": 410,
      "c2175": 411,
      "c2176": 412,
      "c2177": 413,
      "c2178": 414,
      "c2179": 415,
      "c2180": 416,
      "c2181": 417,
      "c2182": 418,
      "c2183": 419,
      "c2184": 420,
      "c2185": 421,
      "c2186": 422,
      "c2187": 423,
      "c2188": 424,
      "c2189": 425,
      "c2190": 426,
      "c2191": 427,
      "c2192": 428,
      "c2193": 429,
      "c2194": 430,
      "c2195": 431,
      "c2196": 432,
      "c2197": 433,
      "c2198": 434,
      "c2199": 435,
      "c2200": 436,
      "c2201": 437,
      "c2202": 438,
      "c2203": 439,
      "c2204": 440,
      "c2205": 441,
      "c2206": 442,
      "c2207": 443,
      "c2208": 444,
      "c2209": 445,
      "c2210": 446,
      "c2211": 447,
      "c2212": 448,
      "c2213": 449,
      "c2214": 450,
      "c2215": 451,
      "c2216": 452,
      "c2217": 453,
      "c2218": 454,
      "c2219": 455,
      "c2220": 456,
      "c2221": 457,
      "c2222": 458,
      "c2223": 459,
      "c2224": 460,
      "c2225": 461,
      "c2226": 462,
      "c2227": 463,
      "c2228": 464,
      "c2229": 465,
      "c2230": 466,
      "c2231": 467,
      "c2232": 468,
      "c30": 469,
      "c31": 470,
      "c32": 471,
      "c33": 472,
      "c34": 473,
      "c35": 474,
      "c36": 475,
      "c37": 476,
      "c38": 477,
      "c39": 478,
      "c310": 479,
      "c311": 480,
      "c312": 481,
      "c313": 482,
      "c314": 483,
      "c315": 484,
      "c316": 485,
      "c317": 486,
      "c318": 487,
      "c319": 488,
      "c320": 489,
      "c321": 490,
      "c322": 491,
      "c323": 492,
      "c324": 493,
      "c325": 494,
      "c326": 495,
      "c327": 496,
      "c328": 497,
      "c329": 498,
      "c330": 499,
      "c331": 500,
      "c332": 501,
      "c333": 502,
      "c334": 503,
      "c335": 504,
      "c336": 505,
      "c337": 506,
      "c338": 507,
      "c339": 508,
      "c340": 509,
      "c341": 510,
      "c342": 511,
      "c343": 512,
      "c344": 513,
      "c345": 514,
      "c346": 515,
      "c347": 516,
      "c348": 517,
      "c349": 518,
      "c350": 519,
      "c351": 520,
      "c352": 521,
      "c353": 522,
      "c354": 523,
      "c355": 524,
      "c356": 525,
      "c357": 526,
      "c358": 527,
      "c359": 528,
      "c360": 529,
      "c361": 530,
      "c362": 531,
      "c363": 532,
      "c364": 533,
      "c365": 534,
      "c366": 535,
      "c367": 536,
      "c368": 537,
      "c369": 538,
      "c370": 539,
      "c371": 540,
      "c372": 541,
      "c373": 542,
      "c374": 543,
      "c375": 544,
      "c376": 545,
      "c377": 546,
      "c378": 547,
      "c379": 548,
      "c380": 549,
      "c381": 550,
      "c382": 551,
      "c383": 552,
      "c384": 553,
      "c385": 554,
      "c386": 555,
      "c387": 556,
      "c388": 557,
      "c389": 558,
      "c390": 559,
      "c391": 560,
      "c392": 561,
      "c393": 562,
      "c394": 563,
      "c395": 564,
      "c396": 565,
      "c397": 566,
      "c398": 567,
      "c399": 568,
      "c3100": 569,
      "c3101": 570,
      "c3102": 571,
      "c3103": 572,
      "c3104": 573,
      "c3105": 574,
      "c3106": 575,
      "c3107": 576,
      "c3108": 577,
      "c3109": 578,
      "c3110": 579,
      "c3111": 580,
      "c3112": 581,
      "c3113": 582,
      "c3114": 583,
      "c3115": 584,
      "c3116": 585,
      "c3117": 586,
      "c3118": 587,
      "c3119": 588,
      "c3120": 589,
      "c3121": 590,
      "c3122": 591,
      "c3123": 592,
      "c3124": 593,
      "c3125": 594,
      "c3126": 595,
      "c3127": 596,
      "c3128": 597,
      "c3129": 598,
      "c3130": 599,
      "c3131": 600,
      "c3132": 601,
      "c3133": 602,
      "c3134": 603,
      "c3135": 604,
      "c3136": 605,
      "c3137": 606,
      "c3138": 607,
      "c3139": 608,
      "c3140": 609,
      "c3141": 610,
      "c3142": 611,
      "c3143": 612,
      "c3144": 613,
      "c3145": 614,
      "c3146": 615,
      "c3147": 616,
      "c3148": 617,
      "c3149": 618,
      "c3150": 619,
      "c3151": 620,
      "c3152": 621,
      "c3153": 622,
      "c3154": 623,
      "c3155": 624,
      "c3156": 625,
      "c3157": 626,
      "c3158": 627,
      "c3159": 628,
      "c3160": 629,
      "c3161": 630,
      "c3162": 631,
      "c3163": 632,
      "c3164": 633,
      "c3165": 634,
      "c3166": 635,
      "c3167": 636,
      "c3168": 637,
      "c3169": 638,
      "c3170": 639,
      "c3171": 640,
      "c3172": 641,
      "c3173": 642,
      "c3174": 643,
      "c3175": 644,
      "c3176": 645,
      "c3177": 646,
      "c3178": 647,
      "c3179": 648,
      "c3180": 649,
      "c3181": 650,
      "c3182": 651,
      "c3183": 652,
      "c3184": 653,
      "c3185": 654,
      "c3186": 655,
      "c3187": 656,
      "c3188": 657,
      "c3189": 658,
      "c3190": 659,
      "c3191": 660,
      "c3192": 661,
      "c3193": 662,
      "c3194": 663,
      "c3195": 664,
      "c3196": 665,
      "c3197": 666,
      "c3198": 667,
      "c3199": 668,
      "c3200": 669,
      "c3201": 670,
      "c3202": 671,
      "c3203": 672,
      "c3204": 673,
      "c3205": 674,
      "c3206": 675,
      "c3207": 676,
      "c3208": 677,
      "c3209": 678,
      "c3210": 679,
      "c3211": 680,
      "c3212": 681,
      "c3213": 682,
      "c3214": 683,
      "c3215": 684,
      "c3216": 685,
      "c3217": 686,
      "c3218": 687,
      "c3219": 688,
      "c3220": 689,
      "c3221": 690,
      "c3222": 691,
      "c3223": 692,
      "c3224": 693,
      "c3225": 694,
      "c3226": 695,
      "c3227": 696,
      "c3228": 697,
      "c3229": 698,
      "c3230": 699,
      "c3231": 700,
      "c3232": 701,
      "dns,sip": 702,
      "dhcp": 703,
      "other": 704,
      "sip": 705,
      "http,socks": 706,
      "smtp,ssl": 707,
      "http,irc": 708,
      "socks": 709,
      "ssh": 710,
      "http,ssh": 711,
      "http": 712,
      "krb_tcp": 713,
      "irc": 714,
      "radius": 715,
      "ftp-data": 716,
      "snmp": 717,
      "dns": 718,
      "pop3": 719,
      "ftp": 720,
      "krb": 721,
      "smtp": 722,
      "ssl": 723,
      "rdp": 724,
      "0.0": 725,
      "0.00": 726,
      "0.01": 727,
      "0.02": 728,
      "0.03": 729,
      "0.04": 730,
      "0.05": 731,
      "0.06": 732,
      "0.07": 733,
      "0.08": 734,
      "0.09": 735,
      "0.10": 736,
      "0.1": 737,
      "0.11": 738,
      "0.12": 739,
      "0.13": 740,
      "0.14": 741,
      "0.15": 742,
      "0.16": 743,
      "0.17": 744,
      "0.18": 745,
      "0.19": 746,
      "0.20": 747,
      "0.2": 748,
      "0.21": 749,
      "0.22": 750,
      "0.23": 751,
      "0.24": 752,
      "0.25": 753,
      "0.26": 754,
      "0.27": 755,
      "0.28": 756,
      "0.29": 757,
      "0.30": 758,
      "0.3": 759,
      "0.31": 760,
      "0.32": 761,
      "0.33": 762,
      "0.34": 763,
      "0.35": 764,
      "0.36": 765,
      "0.37": 766,
      "0.38": 767,
      "0.39": 768,
      "0.40": 769,
      "0.4": 770,
      "0.41": 771,
      "0.42": 772,
      "0.43": 773,
      "0.44": 774,
      "0.45": 775,
      "0.46": 776,
      "0.47": 777,
      "0.48": 778,
      "0.49": 779,
      "0.50": 780,
      "0.5": 781,
      "0.51": 782,
      "0.52": 783,
      "0.53": 784,
      "0.54": 785,
      "0.55": 786,
      "0.56": 787,
      "0.57": 788,
      "0.58": 789,
      "0.59": 790,
      "0.60": 791,
      "0.6": 792,
      "0.61": 793,
      "0.62": 794,
      "0.63": 795,
      "0.64": 796,
      "0.65": 797,
      "0.66": 798,
      "0.67": 799,
      "0.68": 800,
      "0.69": 801,
      "0.70": 802,
      "0.7": 803,
      "0.71": 804,
      "0.72": 805,
      "0.73": 806,
      "0.74": 807,
      "0.75": 808,
      "0.76": 809,
      "0.77": 810,
      "0.78": 811,
      "0.79": 812,
      "0.80": 813,
      "0.8": 814,
      "0.81": 815,
      "0.82": 816,
      "0.83": 817,
      "0.84": 818,
      "0.85": 819,
      "0.86": 820,
      "0.87": 821,
      "0.88": 822,
      "0.89": 823,
      "0.90": 824,
      "0.9": 825,
      "0.91": 826,
      "0.92": 827,
      "0.93": 828,
      "0.94": 829,
      "0.95": 830,
      "0.96": 831,
      "0.97": 832,
      "0.98": 833,
      "0.99": 834,
      "1.00": 835,
      "1.0": 836,
      "0": 837,
      "1": 838,
      "2": 839,
      "3": 840,
      "4": 841,
      "5": 842,
      "6": 843,
      "7": 844,
      "8": 845,
      "9": 846,
      "10": 847,
      "11": 848,
      "12": 849,
      "13": 850,
      "14": 851,
      "15": 852,
      "16": 853,
      "17": 854,
      "18": 855,
      "19": 856,
      "20": 857,
      "21": 858,
      "22": 859,
      "23": 860,
      "24": 861,
      "25": 862,
      "26": 863,
      "27": 864,
      "28": 865,
      "29": 866,
      "30": 867,
      "31": 868,
      "32": 869,
      "33": 870,
      "34": 871,
      "35": 872,
      "36": 873,
      "37": 874,
      "38": 875,
      "39": 876,
      "40": 877,
      "41": 878,
      "42": 879,
      "43": 880,
      "44": 881,
      "45": 882,
      "46": 883,
      "47": 884,
      "48": 885,
      "49": 886,
      "50": 887,
      "51": 888,
      "52": 889,
      "53": 890,
      "54": 891,
      "55": 892,
      "56": 893,
      "57": 894,
      "58": 895,
      "59": 896,
      "60": 897,
      "61": 898,
      "62": 899,
      "63": 900,
      "64": 901,
      "65": 902,
      "66": 903,
      "67": 904,
      "68": 905,
      "69": 906,
      "70": 907,
      "71": 908,
      "72": 909,
      "73": 910,
      "74": 911,
      "75": 912,
      "76": 913,
      "77": 914,
      "78": 915,
      "79": 916,
      "80": 917,
      "81": 918,
      "82": 919,
      "83": 920,
      "84": 921,
      "85": 922,
      "86": 923,
      "87": 924,
      "88": 925,
      "89": 926,
      "90": 927,
      "91": 928,
      "92": 929,
      "93": 930,
      "94": 931,
      "95": 932,
      "96": 933,
      "97": 934,
      "98": 935,
      "99": 936,
      "100": 937,
      "OTH": 938,
      "REJ": 939,
      "RSTO": 940,
      "RSTOS0": 941,
      "RSTR": 942,
      "RSTRH": 943,
      "S0": 944,
      "S1": 945,
      "S2": 946,
      "S3": 947,
      "SF": 948,
      "SH": 949,
      "SHR": 950
    },
    "unk_token": "[UNK]"
  }
}